app/controllers/root_controller.rb

  def index
    @posts = TodoApp.all
---
SELECT `todo_apps`.* FROM `todo_apps`

  def add
    @post = TodoApp.new
    @post.title = params[:title]
    @post.description = params[:description]
    @post.save
---
INSERT INTO `todo_apps` (`title`, `description`, `created_at`, `updated_at`) VALUES ('asdf', 'asdf', '2024-01-02 14:20:01.261167', '2024-01-02 14:20:01.261167')

  def update
    @post = TodoApp.find(params[:id])
---
SELECT `todo_apps`.* FROM `todo_apps` WHERE `todo_apps`.`id` = 9 LIMIT 1

  def updateform=
    @post = TodoApp.find(params[:id])
    # @id = params[:id]
    @post.title = params[:title]
    @post.description = params[:description]
    @post.save
    @posts = TodoApp.all
---
SELECT `todo_apps`.* FROM `todo_apps` WHERE `todo_apps`.`id` = 17 LIMIT 1
UPDATE `todo_apps` SET `todo_apps`.`title` = 'todo', `todo_apps`.`description` = 'gbhjbu', `todo_apps`.`updated_at` = '2024-01-02 19:23:43.603375' WHERE `todo_apps`.`id` = 17
SELECT `todo_apps`.* FROM `todo_apps`

  def delete
    @post = TodoApp.find(params[:id])
    @post.destroy
---
SELECT `todo_apps`.* FROM `todo_apps` WHERE `todo_apps`.`id` = 25 LIMIT 1
DELETE FROM `todo_apps` WHERE `todo_apps`.`id` = 25

  def search
   @search_input = params[:search_input]
   @posts = TodoApp.where("title LIKE '%#{@search_input}%'")
---
SELECT `todo_apps`.* FROM `todo_apps` WHERE (title LIKE '%%')